nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/sqi/processor/sqi_p32mz1024eff124.h
PLIB_INLINE_API void PLIB_SQI_DMABDPollDisable(SQI_MODULE_ID index)
{
     SQI_DMABDPollDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_DMABDPollIsEnabled(SQI_MODULE_ID index)
{
     return SQI_DMABDPollIsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsBDPollingEnable(SQI_MODULE_ID index)
{
     return SQI_ExistsBDPollingEnable_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_DMABDFetchStart(SQI_MODULE_ID index)
{
     SQI_DMABDFetchStart_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_DMABDFetchStop(SQI_MODULE_ID index)
{
     SQI_DMABDFetchStop_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsDMABDFetch(SQI_MODULE_ID index)
{
     return SQI_ExistsDMABDFetch_Default(index);
}

PLIB_INLINE_API void* PLIB_SQI_DMABDCurrentAddressGet(SQI_MODULE_ID index)
{
     return SQI_DMABDCurrentAddressGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsBDCurrentAddress(SQI_MODULE_ID index)
{
     return SQI_ExistsBDCurrentAddress_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_DMABDBaseAddressSet(SQI_MODULE_ID index, void* baseBDAddress)
{
     SQI_DMABDBaseAddressSet_Default(index, baseBDAddress);
}

PLIB_INLINE_API void* PLIB_SQI_DMABDBaseAddressGet(SQI_MODULE_ID index)
{
     return SQI_DMABDBaseAddressGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsBDBaseAddress(SQI_MODULE_ID index)
{
     return SQI_ExistsBDBaseAddress_Default(index);
}

PLIB_INLINE_API SQI_BD_STATE PLIB_SQI_DMABDStateGet(SQI_MODULE_ID index)
{
     return SQI_DMABDStateGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsBDProcessState(SQI_MODULE_ID index)
{
     return SQI_ExistsBDProcessState_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_DMAHasStarted(SQI_MODULE_ID index)
{
     return SQI_DMAHasStarted_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsDMAProcessInProgress(SQI_MODULE_ID index)
{
     return SQI_ExistsDMAProcessInProgress_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_DMABDIsBusy(SQI_MODULE_ID index)
{
     return SQI_DMABDIsBusy_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsDMAEngineBusy(SQI_MODULE_ID index)
{
     return SQI_ExistsDMAEngineBusy_Default(index);
}

PLIB_INLINE_API uint16_t PLIB_SQI_DMABDControlWordGet(SQI_MODULE_ID index)
{
     return SQI_DMABDControlWordGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsBDControlWord(SQI_MODULE_ID index)
{
     return SQI_ExistsBDControlWord_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_DMABDPollCounterSet(SQI_MODULE_ID index, uint16_t pollCount)
{
     SQI_DMABDPollCounterSet_Default(index, pollCount);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsBDPollCount(SQI_MODULE_ID index)
{
     return SQI_ExistsBDPollCount_Default(index);
}

PLIB_INLINE_API SQI_BD_STATE PLIB_SQI_DMABDTransmitStateGet(SQI_MODULE_ID index)
{
     return SQI_DMABDTransmitStateGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsBDTxState(SQI_MODULE_ID index)
{
     return SQI_ExistsBDTxState_Default(index);
}

PLIB_INLINE_API uint8_t PLIB_SQI_DMABDTransmitBufferCountGet(SQI_MODULE_ID index)
{
     return SQI_DMABDTransmitBufferCountGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsBDTxBufCount(SQI_MODULE_ID index)
{
     return SQI_ExistsBDTxBufCount_Default(index);
}

PLIB_INLINE_API uint8_t PLIB_SQI_DMABDTransmitBufferLengthGet(SQI_MODULE_ID index)
{
     return SQI_DMABDTransmitBufferLengthGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsBDTxLength(SQI_MODULE_ID index)
{
     return SQI_ExistsBDTxLength_Default(index);
}

PLIB_INLINE_API SQI_BD_STATE PLIB_SQI_DMABDReceiveStateGet(SQI_MODULE_ID index)
{
     return SQI_DMABDReceiveStateGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsBDRxState(SQI_MODULE_ID index)
{
     return SQI_ExistsBDRxState_Default(index);
}

PLIB_INLINE_API uint8_t PLIB_SQI_DMABDReceiveBufferCountGet(SQI_MODULE_ID index)
{
     return SQI_DMABDReceiveBufferCountGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsBDRxBufCount(SQI_MODULE_ID index)
{
     return SQI_ExistsBDRxBufCount_Default(index);
}

PLIB_INLINE_API uint8_t PLIB_SQI_DMABDReceiveBufferLengthGet(SQI_MODULE_ID index)
{
     return SQI_DMABDReceiveBufferLengthGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsBDRxLength(SQI_MODULE_ID index)
{
     return SQI_ExistsBDRxLength_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_ControlBufferThresholdSet(SQI_MODULE_ID index, uint8_t threshold)
{
     SQI_ControlBufferThresholdSet_Default(index, threshold);
}

PLIB_INLINE_API uint8_t PLIB_SQI_ControlBufferThresholdGet(SQI_MODULE_ID index)
{
     return SQI_ControlBufferThresholdGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsConBufThreshold(SQI_MODULE_ID index)
{
     return SQI_ExistsConBufThreshold_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_InterruptSignalEnable(SQI_MODULE_ID index, SQI_INTERRUPTS interruptFlag)
{
     SQI_InterruptSignalEnable_Default(index, interruptFlag);
}

PLIB_INLINE_API void PLIB_SQI_InterruptSignalDisable(SQI_MODULE_ID index, SQI_INTERRUPTS interruptFlag)
{
     SQI_InterruptSignalDisable_Default(index, interruptFlag);
}

PLIB_INLINE_API void PLIB_SQI_InterruptSignalDisableAll(SQI_MODULE_ID index)
{
     SQI_InterruptSignalDisableAll_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_InterruptSignalIsEnabled(SQI_MODULE_ID index, SQI_INTERRUPTS interruptFlag)
{
     return SQI_InterruptSignalIsEnabled_Default(index, interruptFlag);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsInterruptSignalControl(SQI_MODULE_ID index)
{
     return SQI_ExistsInterruptSignalControl_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_TapDelaySet(SQI_MODULE_ID index, uint8_t sdrClkInDly, uint8_t dataOutDly, uint8_t clkOutDly)
{
     SQI_TapDelaySet_Default(index, sdrClkInDly, dataOutDly, clkOutDly);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsTapDelay(SQI_MODULE_ID index)
{
     return SQI_ExistsTapDelay_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_XIPControlWord3Set(SQI_MODULE_ID index, bool initStatCheck, uint8_t initCmdCount, SQI_LANE_MODE initCmdType, uint8_t initCmd3, uint8_t initCmd2, uint8_t initCmd1)
{
     SQI_XIPControlWord3Set_Default(index, initStatCheck, initCmdCount, initCmdType, initCmd3, initCmd2, initCmd1);
}

PLIB_INLINE_API uint32_t PLIB_SQI_XIPControlWord3Get(SQI_MODULE_ID index)
{
     return SQI_XIPControlWord3Get_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsXIPControlWord3(SQI_MODULE_ID index)
{
     return SQI_ExistsXIPControlWord3_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_XIPControlWord4Set(SQI_MODULE_ID index, bool initStatCheck, uint8_t initCmdCount, SQI_LANE_MODE initCmdType, uint8_t initCmd3, uint8_t initCmd2, uint8_t initCmd1)
{
     SQI_XIPControlWord4Set_Default(index, initStatCheck, initCmdCount, initCmdType, initCmd3, initCmd2, initCmd1);
}

PLIB_INLINE_API uint32_t PLIB_SQI_XIPControlWord4Get(SQI_MODULE_ID index)
{
     return SQI_XIPControlWord4Get_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsXIPControlWord4(SQI_MODULE_ID index)
{
     return SQI_ExistsXIPControlWord4_Default(index);
}

#endif
